Repository: milckywayy/EE_CTF_Platform
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Please log in to access this page.
pl: Zaloguj się, aby uzyskać dostęp do tej strony.

source: Error during USOS authentication. Please try again.
pl: Błąd podczas uwierzytelniania USOS. Spróbuj ponownie.

source: You have been logged out.
pl: Zostałeś wylogowany.

source: Challenge not available yet.
pl: Wyzwanie nie jest jeszcze dostępne.

source: Correct flag! Well done!
pl: Prawidłowa flaga! Dobra robota!

source: Incorrect flag. Try again!
pl: Nieprawidłowa flaga. Spróbuj jeszcze raz!

source: Logout
pl: Wyloguj się

source: Login
pl: Zaloguj się

source: Contact
pl: Kontakt

source: Privacy policy
pl: Polityka prywatności

source: Challenge - EE CTF
pl: Strona główna - EE CTF

source: Challenge
pl: Wyzwanie

source: EE_CTF{your_flag_here}
pl: EE_CTF{twoja_flaga}

source: Submit Flag
pl: Wyślij flagę

source: Top 5 Solvers
pl: Top 5 wyników

source: Not solved yet!
pl: Nie rozwiązane!

source: Rate this Challenge
pl: Oceń wyzwanie

source: Share your thoughts about challenge
pl: Podziel się opinią o wyzwaniu

source: Submit Comment
pl: Zapisz komentarz

source: Edit Comment
pl: Edytuj komentarz

source: Save Comment
pl: Zapisz komentarz

source: Cancel
pl: Anuluj

source: Contact - EE CTF
pl: Logowanie - EE CTF

source: Contact Us
pl: Kontakt

source: Project Lead, infrastructure, container management, technical matters.
pl: Kierownik projektu, infrastruktura, zarządzanie kontenerami, sprawy techniczne.

source: Coordination of Content, Quality Assurance, and Task Management in CTF.
pl: Koordynacja treści, zapewnianie jakości oraz zarządzanie zadaniami w CTF.

source: Home - EE CTF
pl: Strona główna - EE CTF

source: Welcome to the Electric CTF Platform!
pl: Witamy na platformie Elektryczny CTF!

source: Enhance your cybersecurity skills with our CTF challenges.
pl: Rozwijaj swoje umiejętności w zakresie cyberbezpieczeństwa dzięki naszym wyzwaniom CTF.

source: Welcome back
pl: Witamy ponownie

source: Please log in to access our challenges.
pl: Zaloguj się, aby uzyskać dostęp do naszych wyzwań.

source: Available Challenges
pl: Dostępne wyzwania

source: Available from
pl: Dostępne od

source: Login - EE CTF
pl: Logowanie - EE CTF

source: Authenticate using your USOS account to access our platform.
pl: Uwierzytelnij się za pomocą konta USOS, aby uzyskać dostęp do naszej platformy.

source: Login with USOS
pl: Zaloguj się przez USOS

source: Privacy policy - EE CTF
pl: Profil - EE CTF

source: Privacy Policy
pl: Polityka prywatności

source: Effective date: July 10, 2024
pl: Data wejścia w życie: 10 lipca 2024

source: Introduction
pl: Wprowadzenie

source: This Privacy Policy applies to the online platform "Electric CTF". In this document, we describe what personal data we collect from our users, how it is stored, secured, and how it is used.
pl: Polityka prywatności dotyczy platformy online "Elektryczny CTF". W tym dokumencie opisujemy, jakie dane osobowe zbieramy od naszych użytkowników, jak są one przechowywane, zabezpieczane i wykorzystywane.

source: Data Collected
pl: Zbierane dane

source: USOS ID
pl: ID USOS

source: Email address in the PW domain
pl: Adres e-mail w domenie PW

source: First and last name
pl: Imię i nazwisko

source: Profile picture in the USOS system (if not restricted)
pl: Zdjęcie profilowe w systemie USOS (jeśli dostępne)

source: Data Storage and Security
pl: Przechowywanie i bezpieczeństwo danych

source: All collected data is stored in a database on our server.
pl: Wszystkie zebrane dane są przechowywane w bazie danych na naszym serwerze.

source: Use of Data
pl: Wykorzystanie danych

source: Collected data is used for the following purposes:
pl: Zebrane dane są wykorzystywane do następujących celów:

source: User identification
pl: Identyfikacja użytkownika

source: Contact with event participants (e.g., for awarding prizes)
pl: Kontakt z uczestnikami wydarzeń (np. w celu przyznawania nagród)

source: Creating usage statistics of the platform
pl: Tworzenie statystyk użytkowania platformy

source: User Rights
pl: Prawa użytkownika

source: The user of the platform has the right to access, correct, and delete their personal data. The user can also withdraw their consent to the processing of personal data at any time.
pl: Użytkownik platformy ma prawo do dostępu, poprawiania i usuwania swoich danych osobowych. Użytkownik może również w dowolnym momencie wycofać swoją zgodę na przetwarzanie danych osobowych.

source: Changes to the Privacy Policy
pl: Zmiany w Polityce Prywatności

source: We reserve the right to make changes to this Privacy Policy. We will inform users of any changes by updating this document.
pl: Zastrzegamy sobie prawo do wprowadzania zmian w Polityce Prywatności. Poinformujemy użytkowników o wszelkich zmianach poprzez aktualizację tego dokumentu.

source: If you have any questions regarding this Privacy Policy, please contact us at <a href="mailto:01178835@pw.edu.pl">01178835@pw.edu.pl</a>.
pl: Jeśli masz jakiekolwiek pytania dotyczące Polityki Prywatności, prosimy o kontakt pod adresem <a href="mailto:01178835@pw.edu.pl">01178835@pw.edu.pl</a>.

source: Profile - EE CTF
pl: Profil - EE CTF

source: User Details
pl: Szczegóły użytkownika

source: First Name
pl: Imię

source: Last Name
pl: Nazwisko

source: Easy
pl: Łatwe

source: Medium
pl: Średnie

source: Hard
pl: Trudne
